# GetEnumerator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryElement..::..GetEnumerator Method
GeometryElement Class See Also
---
Returns an enumerator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<GeometryObject> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of GeometryObject)
```

Visual C++
---
```text
public:
virtual IEnumerator<GeometryObject^>^ GetEnumerator()
```

# ### Return Value
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace